#include <stdio.h>

int main() {
    // 1. Оголошення змінних (Виділення пам'яті)
    // Резервування 1 байта в оперативній пам'яті для зберігання сирого символу.
    // До моменту ініціалізації ця комірка містить системне "сміття".
    char answer;

    // 2. Виклик функції (Вивід у стандартний потік)
    // Передача керування системній функції printf для відображення тексту.
    // Кількість параметрів: 1 (передається лише рядок форматування).
    printf("Is it raining outside? [y/n]: ");

    // 3. Ініціалізація змінної (Захоплення та запис даних)
    // Читання байта з потоку вводу та його запис за фізичною адресою змінної (&answer).
    // Кількість параметрів: 2 (рядок форматування "%c" та вказівник на пам'ять).
    // Пробіл перед %c діє як фільтр — відсіює невидимий системний шум (наприклад, '\n').
    scanf(" %c", &answer);

    // 4. Перехід по гілкам (Керування потоком виконання)
    // Маршрутизація логіки процесора залежно від стану ініціалізованої змінної answer.
    if (answer == 'y') {
     // 5.1 Стрибаємо в цей блок, якщо  answer == 'y' - правда
        printf("Don't forget your umbrella! \n");

    // Після цього блоку відразу стрибаємо на return 0;

    } // 5.2 Стрибаємо на цей рядок, якщо  answer == 'y' - неправда
    else if (answer == 'n') {
      // 5.3 Стрибаємо в цей блок, якщо  answer == 'n' - правда
        printf("You don't need an umbrella.\n");

    // Після цього блоку відразу стрибаємо на return 0;

    }// 5.4 Стрибаємо на цей рядок, якщо  answer == 'n' - неправда
    else {

        printf("System confused. Please answer 'y' or 'n'.\n");
    }

    return 0; // Штатне завершення процесу та повернення коду 0 операційній системі
}
