#include <stdio.h>

int main() {
    // 1. Оголошення змінних (Виділення пам'яті)
    // Резервування 1 байта в оперативній пам'яті для зберігання сирого символу.
    // До моменту ініціалізації ця комірка містить системне "сміття".
    char answer;

    // 2. Виклик функції (Вивід у стандартний потік)
    // Передача керування системній функції printf для відображення тексту.
    // Кількість параметрів: 1 (передається лише рядок форматування).
    printf("Is it raining outside? [y/n]: ");

    // 3. Ініціалізація змінної (Захоплення та запис даних)
    // Читання байта з потоку вводу та його запис за фізичною адресою змінної (&answer).
    // Кількість параметрів: 2 (рядок форматування "%c" та вказівник на пам'ять).
    // Пробіл перед %c діє як фільтр — відсіює невидимий системний шум (наприклад, '\n').
    scanf(" %c", &answer);

    // 4. Перехід по гілкам (Керування потоком виконання)
    // Маршрутизація логіки процесора залежно від стану ініціалізованої змінної answer.
    if (answer == 'y') {
     // 5.1 Стрибаємо в цей блок, якщо  answer == 'y' - правда
        printf("Don't forget your umbrella! \n");

    // Після цього блоку відразу стрибаємо на return 0;

    } // 5.2 Стрибаємо на цей рядок, якщо  answer == 'y' - неправда
    else if (answer == 'n') {
      // 5.3 Стрибаємо в цей блок, якщо  answer == 'n' - правда
        printf("You don't need an umbrella.\n");

    // Після цього блоку відразу стрибаємо на return 0;

    }// 5.4 Стрибаємо на цей рядок, якщо  answer == 'n' - неправда
    else {

        printf("System confused. Please answer 'y' or 'n'.\n");
    }



     double a = 0.0;       // Нижня межа інтегрування
     double b = 4.0;       // Верхня межа інтегрування
     int step_s = 1000;    // Кількість відрізків розбиття (чим більше, тим точніше)
     double step_integral = 0;    // Крок розрахунку інтегралу
     double tmp_integral = 0;     // Значення функції f(x) = x^2 у вн. точка розбиття
     double tmp = 0;

     double res_integral = 0;

    //================================================================================
    // Приклад - складений метод трапецій на рівномірному розбитті відрізка.
    //================================================================================

    //================================================================================
    // Математична  функція  f(x) = x^2 Мовою С у цьому коді це x*x !
    // Код реалізований без використання функцій мови С.
    //================================================================================

    step_integral = (b - a) / step_s; // Розраховуємо крок розрахунку
    //  |_______a___________b______> X Відрізок. Межі інтегрування.
    //  |_______a_|_|_|_|_|_b______> X Ділємо цей відрізок на кількість кроків розрахунку

    tmp_integral = 0.5 * (a*a + b*b); // Початкова сума (половина значень на краях)

    // Додаємо значення функції у внутрішніх точках розбиття. Знаходимо результат.
    for (int i = 1; i < step_s; i++) {
        tmp = a + i * step_integral;
        tmp_integral += tmp*tmp;//   f(x) = x^2 Мовою С це x*x ! Накопичуємо значення
    }
    //  Виконуємо остаточний розрахунок
    res_integral = tmp_integral*step_integral;
    //  Виводимо значення розрахунку на консоль
    printf("Значення інтеграла на відрізку [%.1f, %.1f]: %f\n", a, b, res_integral);
    //  Для зупинки консолі
    scanf(" %c", &answer);

    //================================================================================
    // Перевірка. Для а=0 b=3 res_integral=9.  Для а=0 b=4 res_integral=21.333
    //================================================================================

    return 0; // Штатне завершення процесу та повернення коду 0 операційній системі
}
